{
    "26-10-2023-Terraria": {
        "info":"Create and enter your spookiest original Terraria creations and win amazing prizes!",
        "nameList":"Terraria State of the Game - October 2023",
        "logoList":"../images/news/terraria/26-10-2023/logo-this.png",
        
        "date":"чт, 26 октября",
        "logo": "../images/news/terraria/26-10-2023/logo-modal.png",
        "name": "Terraria State of the Game - October 2023",
        "youtube":null, 
        "firstimg": "../images/news/terraria/26-10-2023/logo-modal.png",
        "content1":"Greetings Terrarians! <br><br>",
        "content2": "Spooky season is finally upon us! We hope that your pumpkin carving, candy collecting, haunted house visiting, and trick or treat preparations have been going quite well. On our end, we have loved seeing the Halloween Contest entries coming in (over 300 entries and counting - you still have time to get your amazing Pumpkins, Costumes, and more in!) while we continue to work away on 1.4.5. We are also getting really excited to see some of the other Terraria things that will be coming out over the Holidays, such as the next wave of the Terraria Graphic Novel, new merch stuff, and more. It is also the time of the year where we really start to reflect on how much we appreciate each and every one of you and your support. We will say it again (probably more than once) - thank you so much for all that you do for us!",
        "content3":"<br> <br> That said, let's go door to door for the latest Terraria treats - no tricks, we promise! <br>",
        "secondimg":"../images/news/terraria/terraria-dividing.png",
        "title":"<br><br>PC - RE-LOGIC",
        "titlemini":"<br> <br>TERRARIA 1.4.5 - BAT!",
        "content4":"<br><br>Another great month of development has come and gone, and the team is really feeling great about what we have in game thus far as well as what we still have planned/on deck to add before we can call 1.4.5 complete. It is becoming increasingly hard to not spoil some of our favorite bits - but our willpower is winning out thus far. No estimate on timing to add just yet, but it is looking increasingly likely that we are looking at a 2024 release for 1.4.5 at this point. You know our mantra for updates - they are done when they are done. Hang in there with us a bit longer, it will be worth it. ",
        "content5":"<br><br>What better spoiler for the Halloween Season than to share one of our newest additions - the Vampire Bat transformation! <br>",        
        "tringimg":"../images/news/terraria/26-10-2023/gif1.gif",
        "content6":"<br>Don't worry, when your nighttime aerial hijinks are concluded, you will be able to safely return to your... Human Form!",
        "content7":"<br><br> Until next time folks - the Holidays are closing in and we cannot wait to see what they hold!"
    },
    "10-11-2023-CS2": {
        "info":"Небольшое обновление или список изменений",
        "nameList":"Release Notes for 11/9/2023",
        "logoList":"../images/20 na 9/cs.jpg",

        "date":"пт, 10 ноября",
        "logo":null,
        "name": "Release Notes for 11/9/2023",
        "youtube":null,
        "firstimg":null,
        "content1":"Added support for accepting game invites and party invites from Steam Chat and Steam Overlay.",
        "content2": "<br><br>Added an execution delay for certain commands that can be specified on command line to be deferred until main menu fully loads (e.g. econ action preview commands, match download commands, playdemo, and similar).",
        "content3":"<br><br>Fixed a bug that caused game events to not appear in CSTV demos recorded in tv_record_immediate mode.",
        "secondimg":null,
        "title":null,
        "titlemini":null,
        "content4":"<br><br>CSTV auto record now requires either an active CSTV server or tv_record_immediate to be enabled.",
        "content5":"<br><br>Performance optimizations in game server demo recording code.",        
        "tringimg":null,
        "content6":null,
        "content7":null
    },
    "30-08-2023-warhammerSM2": {
        "info":"Смотрите, как лейтенант Титус вместе с братьями Чайроном и Гадриелем крошат на куски сотни тиранидов. Сегодня мы с радостью представляем вам, пожалуй, самый полный обзор геймплея...",
        "nameList":"Встречайте расширенный геймплейный трейлер Space Marine 2!",
        "logoList":"../images/news/warhammer_SM2/30-08-2023/logo-this.jpg",

        "date":"ср, 30 агуста",
        "logo":null,
        "name": "Встречайте расширенный геймплейный трейлер Space Marine 2!<br>",
        "youtube":"https://www.youtube-nocookie.com/embed/GpYIuo3xGA8?si=cugiJbwUgYnOFf90",
        "firstimg":null,
        "content1":"Смотрите, как лейтенант Титус вместе с братьями Чайроном и Гадриелем крошат на куски сотни тиранидов.",
        "content2": "<br><br>Сегодня мы с радостью представляем вам, пожалуй, самый полный обзор геймплея Space Marine 2 на текущий момент. В этом 10-минутном геймплейном видео лейтенант Титус и его боевые братья Чайрон и Гадриель изничтожают стаи тиранидов на планете Аваракс. <br>",
        "content3":null,
        "secondimg":null,
        "title":null,
        "titlemini":"<br><br>Услышьте зов битвы! В далеком темном будущем вас ждет лишь война.",
        "content4":"<br><br>Продолжите историю легендарного лейтенанта Титуса, озвученного звездой фильмов «Викинги» и «Одержимые» Клайвом Стэнденом, в новой масштабной кампании Warhammer 40,000: Space Marine 2, будь то в одиночку с ИИ или совместно с двумя другими игроками! Используйте всю силу Империума, чтобы защитить человечество от ужасов космоса, включая темные силы Хаоса! Да! Теперь официально: воины легиона Тысячи Сыновей – космодесантники Хаоса, присягнувшие хаоситскому богу судьбы и мутаций, – встретятся вам в игре!",
        "content5":null,        
        "tringimg":"../images/news/warhammer_SM2/30-08-2023/content-1.jpg",
        "content6":null,
        "content7":null
    },
    "20-10-2023-smalland": {
        "info":"A deeper explanation of how the new item quality and enhancement systems work, and enable you to upgrade favourite weapons for late game use.",
        "nameList":"New Crafting and Enhancement Systems Explained",
        "logoList":"../images/news/smalland/20-10-2023/logo-this.png",

        "date":"пт, 20 октября",
        "logo":"../images/news/smalland/20-10-2023/logo-modal.png",
        "name": "New Crafting and Enhancement Systems Explained",
        "youtube":null,
        "firstimg":"../images/news/smalland/20-10-2023/content-1.jpg",
        "content1":"<br><br>One of the biggest under-the-hood improvements made to Smalland: Survive the Wilds in the Amber Valleys update is an overhaul of the crafting system. Here's what has changed and how it works... ",
        "content2": "<br><br><strong>Item Quality</strong> <br> At the point of crafting a weapon or armour, your intelligence stat is taken into account and may affect the quality of the item. Intelligence doesn't translate directly to a specific quality tier being crafted, instead the more points you have in intelligence, the greater the chance of crafting higher quality items.",
        "content3":"<br><br><strong>Item Enhancement</strong> <br>At the workbench, there is now a new tab to Enhance weapons and armour. For a cost, any weapon or armour piece can effectively be upgraded to be as good as the next tier/item type in progression.",
        "secondimg":null,
        "title":null,
        "titlemini":null,
        "content4":"<br><br>This means that if you prefer to keep an early game sword to match your play style, instead of swapping to a more recently added weapon with better stats, you can now enhance that sword so it remains useful even in late game encounters! <br><br> Please note: there is a maximum enhancement tier which is capped at the latest items in the game, so whilst most items can be enhanced up to 3 times, there can be a limit if the item is already late game gear.",
        "content5":"<br><br><strong>Dismantling and recovering resources</strong> <br> Crafted items can now be dismantled to recover some of their component costs. Dismantling does not provide a full refund for any items it is applied to. The amount of resources that you receive for dismantling may be lower if the item has low durability.",        
        "tringimg":null,
        "content6":"<br><br><strong>Respec Attributes</strong> <br> Player attributes can now be reset at Herne for a cost. To restore all of your invested stat points, simply visit Herne at his camp by the Burrows entrance and select the dialogue option which asks to 'refocus my training'.",
        "content7":null
    }
}

